'''У нас есть оценки за некоторый промежуток времени у школьников:
Мария: русский - 4, 3, 4; математика - 5, 4, 4; физика - 5, 5, 4;
Павел: русский - 3, 3, 3; математика - 3, 4, 5, 3; физика - 5, 3, 4;
Алексей: русский - 4, 5, 5, 5; математика - 5, 5, 4; физика - 5, 5, 4, 5;
Ксения: русский - 4, 4, 4; математика - 3, 4, 4, 3; физика - 4, 4, 4;
Нужно создать словарь из этих данных, вычислить средние оценки по предметам для каждого ученика.
Добавить нового ученика: Дарья: русский - 4, математика - 5, физика - 3, 4.
Найти всех учеников, у кого средняя оценка по математике выше 4.5.'''

def avraiting(my_dict):
    new_dict = dict()

    for name, value in my_dict.items():
        new_value = dict()
        for subject, raiting in value.items():
            new_value[subject] = sum(raiting) / len(raiting)
        new_dict[name] = new_value
    return new_dict

def num2():
    my_dict = {"Мария":
                {"Русский": [4, 3, 4], "Математика": [5, 4, 4], "Физика": [5, 5, 4]},
            "Павел":
                {"Русский": [3, 3, 3], "Математика": [3, 4, 5, 3], "Физика": [5, 4, 3]},
            "Алексей":
                {"Русский": [4, 5, 5, 5], "Математика": [5, 5, 4], "Физика": [5, 5, 4, 5]},
            "Ксения":
                {"Русский": [4, 4, 4], "Математика": [3, 4, 4, 3], "Физика": [4, 4, 4]},
            }

    average_ratingDict = avraiting(my_dict)
    print(average_ratingDict)

    my_dict["Дарья"] = {"Русский": [4], "Математика": [5], "Физика": [3, 4]}
    average_ratingDict = avraiting(my_dict)

    for name, value in average_ratingDict.items():
        if (value["Математика"] > 4.5):
            print(name)

if __name__ == "__main__":
    num2()